## Plan Result (853: prod - TerraformPlanApply)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_definition.custom_roles[&#34;Container App Log Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_definition.custom_roles["Container App Log Reader"] will be created
  + resource "azurerm_role_definition" "custom_roles" {
      + assignable_scopes           = [
          + "/providers/Microsoft.Management/managementGroups/HMCTS",
        ]
      + description                 = <<-EOT
            Grants permissions required to read logs from Container Apps. Covers log read operations for monitoring and troubleshooting purposes.
        EOT
      + id                          = (known after apply)
      + name                        = "Container App Log Reader"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/providers/Microsoft.Management/managementGroups/HMCTS"

      + permissions {
          + actions     = [
              + "Microsoft.App/containerApps/logstream/action",
              + "Microsoft.App/containerApps/read",
            ]
          + not_actions = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":178,"Program":"tfcmt","SHA1":"","Target":"853: prod - TerraformPlanApply","Vars":{}} -->